Autodesk.Revit.DB.TableData.IsEqual(Autodesk.Revit.DB.TableData)
Checks if this element is equal in value to the other element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null